//******************************************************************************
// Имя файла    :  'main.c'
// заголовок    :  Основная программа
// Автор        :  Маньянов Р.Р.
// Контакты     :  
// Дата         :  22.04.2016
//******************************************************************************

#include "stm32f10x.h"
#include "GPIO.h"

//==============================================================================
//                          Глобальные переменные
//==============================================================================

    // внешне определенные переменные
    extern Gpio gpioTemp1;
    
//==============================================================================
//                            Основная программа
//==============================================================================

int main(void)
{          
    // инициализация пина
    GPIOInit(&gpioTemp1);  
    
    while(1) 
    {   
        // переключение состояния пина
        GPIOToggle(&gpioTemp1);
        
        // пауза
        uint16_t delay = 0xFFFF;
        while(delay--);
    }
}