<<<<<<< HEAD
﻿
=======

>>>>>>> origin/master
#include "GPIO\GPIO.h"

//==============================================================================
//                          Глобальные переменные
//==============================================================================

    // внешне определенные переменные
    extern sGpio        gpioKey1, 
                        gpioLed1;
    
//==============================================================================
//              Переключение состояния светодиода
//------------------------------------------------------------------------------
//  gpioLed    - пин управления светодиодом
//==============================================================================    
    
<<<<<<< HEAD
void LedToggle (void* gpioLed)
{   
    GPIOToggle((sGpio*)gpioLed);
=======
void LedToggle (void* gpio)
{   
    GPIOToggle(gpio);
>>>>>>> origin/master
}

//==============================================================================
//                         Основная программа
//==============================================================================

<<<<<<< HEAD
int main (void)
=======
int main(void)
>>>>>>> origin/master
{   
    // инициализация пинов
    GPIOInit(&gpioKey1);
    GPIOInit(&gpioLed1);
   
    // конфигурация внешнего прерывания
    GPIOExtiConfig(2, LedToggle, (void*)&gpioLed1, &gpioKey1);
    
    // включение внешнего прерывания
    GPIOExtiEnable (eGpioTriger_FALL, &gpioKey1);

    while(1) 
    {
      
    }
}
