//******************************************************************************
// Имя файла    :  'main.c'
// заголовок    :  Основная программа
// Автор        :  Маньянов Р.Р.
// Контакты     :  
// Дата         :  22.04.2016
//******************************************************************************

#include "GPIO\GPIO.h"

//==============================================================================
//                          Глобальные переменные
//==============================================================================

    // внешне определенные переменные
    extern sGpio        gpioKey,    
                        gpioLed;

//==============================================================================
//              Инициализация пина
//------------------------------------------------------------------------------
//  gpioLed    - пин управления светодиодом
//==============================================================================    
    
void LedCtrl (void* gpioLed)
{   
    GPIOWrite(!GPIOReadIn(&gpioKey), led);
}
    
//==============================================================================
//                            Основная программа
//==============================================================================
    
int main(void)
{   
    // получение частот тактирования
    RCC_GetClocksFreq(&RCC_Clocks);
    
    // инициализация глобального таймера
    InitSysTick(1000);

    // инициализация пинов
    GPIOInit(&gpioKey);
    GPIOInit(&gpioLed);

    // конфигурация внешнего прерывания
    GPIOExtiConfig(eGpioTriger_ALL, 2, LedCtrl, (void*)&gpioLed, &gpioKey);
    
    // включение внешнего прерывания
    GPIOExtiEnable (&gpioKey);

    while(1) 
    {           
       
    }
}